package tarena.util;

public class TaxUtil {
	/**
	 * 根据收入计算个人所得税
	 * @param salary 收入
	 * @return 该上缴的个人所得税
	 *  超过起程线2000以内的,扣2%  sal*2%
	 *  超过起程线2000部分,扣5%  (sal-2000)*5%+2000*2%
	 *  超过起程线3000部分,扣10% (sal-3000)*10%+1000*5%+2000*2%
	 *  超过起程线5000部分,扣15% (sal-5000)*15%+2000*10%+1000*5%+2000*2%
	 *  超过起程线10000部分,扣20% (sal-10000)*20%+5000*15%+2000*10%+1000*5%+2000*2%
	 *  起程线为:3000
	 *  5500-3000=2500, 2000*2%+500*5%
	 */
	public static double tax(double salary){
		double sal = salary-3000;
		if(sal <= 0){
			return 0;
		}else if(sal <= 2000){
			return sal*0.02;
		}else if(sal <= 3000){
			return (sal-2000)*0.05+2000*0.02;
		}else if(sal <= 5000){
			return (sal-3000)*0.1+1000*0.05+2000*0.02;
		}else if(sal <=10000){
			return (sal-5000)*0.15+2000*0.1+1000*0.05+2000*0.02;
		}else{
			return (sal-10000)*0.2+5000*0.15+2000*0.1+1000*0.05+2000*0.02;
		}
	}
}
